&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ЗаполнитьДаннымиИзТЧДокумента();	
	Элементы.Криптовалюты.Доступность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДаннымиИзТЧДокумента()
    ЭтотОбъект.ТаблицаДокумента.Очистить();

    Для Каждого СтрТЧ Из Объект.Документ.ВалютныеПары Цикл
        НоваяСтрока = ЭтотОбъект.ТаблицаДокумента.Добавить();
        НоваяСтрока.ИсходнаяВалюта = СтрТЧ.КриптовалютаИсходная;
        НоваяСтрока.ЦелеваяВалюта = СтрТЧ.КриптовалютаЦелевая;
        НоваяСтрока.Курс = СтрТЧ.Курс;
        НоваяСтрока.Комиссия = СтрТЧ.Комиссия;
	КонецЦикла;

    ТаблицаЗначений = ЭтотОбъект.ТаблицаДокумента;

    Элементы.ИсходнаяКриптовалюта.СписокВыбора.Очистить();
    Элементы.ЦелеваяКриптовалюта.СписокВыбора.Очистить();
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл  
	    ИсходнаяКрипт = СтрокаТЗ.ИсходнаяВалюта;
	    Если Элементы.ИсходнаяКриптовалюта.СписокВыбора.НайтиПоЗначению(ИсходнаяКрипт) = Неопределено Тогда
	        Элементы.ИсходнаяКриптовалюта.СписокВыбора.Добавить(ИсходнаяКрипт);
		КонецЕсли;
		
		ЦелеваяКрипт = СтрокаТЗ.ЦелеваяВалюта;
	    Если Элементы.ЦелеваяКриптовалюта.СписокВыбора.НайтиПоЗначению(ЦелеваяКрипт) = Неопределено Тогда
	        Элементы.ЦелеваяКриптовалюта.СписокВыбора.Добавить(ЦелеваяКрипт);
	    КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура Рассчитать()            
	
	Если Объект.СуммаВИсходнойКриптовалюте = 0 Тогда
		Сообщить("Значение исходной суммы не заполнено");  
		Возврат;
	КонецЕсли;             
	
	Если Объект.ИсходнаяКриптовалюта = Объект.ЦелеваяКриптовалюта Тогда                
		Сообщить("Путь не найден!");  
		Возврат;
	КонецЕсли;

	ИсходныеКриптовалюты = Новый Массив();  
	ЦелевыеКриптовалюты = Новый Массив();   
	Курсы = Новый Массив();  
	Комиссии = Новый Массив();  
	
	Для Каждого СтрокаТЗ Из ТаблицаДокумента Цикл
	    ИсходныеКриптовалюты.Добавить(СтрокаТЗ.ИсходнаяВалюта);   
		ЦелевыеКриптовалюты.Добавить(СтрокаТЗ.ЦелеваяВалюта); 
		Курсы.Добавить(СтрокаТЗ.Курс);
		Комиссии.Добавить(СтрокаТЗ.Комиссия);
	КонецЦикла;
	
    МассивПути = ПросчитатьПуть(ИсходныеКриптовалюты, ЦелевыеКриптовалюты); 
	
	ПросчитатьОбмен(ИсходныеКриптовалюты, ЦелевыеКриптовалюты, Курсы, Комиссии, МассивПути);
	
КонецПроцедуры  

&НаСервере
Процедура ПросчитатьОбмен(ИсходныеКриптовалюты, ЦелевыеКриптовалюты, Курсы, Комиссии, МассивПути)
	
	ТекСумма = Объект.СуммаВИсходнойКриптовалюте;
	Для Счетчик = 0 По МассивПути.Количество()-1 Цикл 
		Индекс = МассивПути.Получить(МассивПути.ВГраница()-Счетчик);
		ТекСумма = ТекСумма*Курсы.Получить(Индекс)*(1-(Комиссии.Получить(Индекс)/100));
		Сообщить(ТекСумма);
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Функция  ПросчитатьПуть(ИсходныеКриптовалюты, ЦелевыеКриптовалюты)
	ТекЦелевая = "";
	ТекИсходная = "";
	МассивПуть = Новый Массив;

	ТекЦелевая = Объект.ЦелеваяКриптовалюта; 
	Индекс = ЦелевыеКриптовалюты.Найти(Строка(ТекЦелевая));
	ТекИсходная = ИсходныеКриптовалюты.Получить(Индекс);
	МассивПуть.Добавить(Индекс);
	
	Для Счетчик = 0 По ИсходныеКриптовалюты.Количество() Цикл
		Если ТекИсходная = Объект.ИсходнаяКриптовалюта Тогда
			Прервать;
		КонецЕсли;
		
		Индекс = ЦелевыеКриптовалюты.Найти(ТекИсходная);
		
		Если Индекс = Неопределено  Тогда                
			Сообщить("Путь не найден!");
		КонецЕсли;
		
		МассивПуть.Добавить(Индекс);
		ТекЦелевая = ТекИсходная;
		ТекИсходная = ИсходныеКриптовалюты.Получить(Индекс);

	КонецЦикла;
	
	Возврат МассивПуть;
КонецФункции


#Область Проверки

&НаКлиенте
Процедура ЦелеваяКриптовалютаПриИзменении(Элемент)
	
	Проверка();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходнаяКриптовалютаПриИзменении(Элемент)
	
	Проверка();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВИсходнойКриптовалютеПриИзменении(Элемент)

	Проверка(); 

КонецПроцедуры

&НаКлиенте
Процедура РасчитатьКоманда(Команда)
	
	Проверка()
	
КонецПроцедуры 


&НаКлиенте
Процедура Проверка()
	
	Если ЗначениеЗаполнено(Объект.ИсходнаяКриптовалюта) И ЗначениеЗаполнено(Объект.ЦелеваяКриптовалюта) Тогда
		Элементы.РасчитатьКоманда.Доступность = Истина;
		Рассчитать(); 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

	
	
